<?php
// +----------------------------------------------------------------------
// | LinkT [Tech makes service easier]
// +----------------------------------------------------------------------
// | Copyright (c) 2013-2017 http://www.linkt.cc All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( 版权所有 )
// +----------------------------------------------------------------------
// | Author: XuKalam <316392750@qq.com>
// +----------------------------------------------------------------------

return [
    0 =>  'success', // 操作成功
    1000 => 'error_system', // 系统错误
    1001 => 'error_params', // 参数错误
    1002 => 'error_sql', // 数据库操作错误,缺少参数或者参数值不正确
    1003 => 'error_path', // 应用路径不存在
    1004 => 'error_module', // 模块不存在或者没有安装
    2000 => 'error_logic', // 逻辑错误,提示性错误
    2001 => 'error_token', // 请登录
    2002 => 'error_merchant', // 请先注册成为商户
    2003 => 'error_vip', // 请成为VIP
    2004 => 'error_agency', // 请成为代理
    3000 => 'error_core', // 核心框架错误
    3001 => 'error_config', // 配置信息出错
    3002 => 'error_user', // 登录用户名错误
    3003 => 'error_password', // 登录密码错误
    3004 => 'error_login' // 登录信息错误
];
